In [2]:
#====Handling Missing Data

import numpy as np
import pandas as pd

data_dict = {"A":[100,23,np.nan,58],
             "B":[15,np.nan,np.nan,373],
             "C":[12,264,578,12],
             "Name":["John","Lee","Mike","John"]}

df = pd.DataFrame(data_dict)

df

       A      B    C  Name
0  100.0   15.0   12  John
1   23.0    NaN  264   Lee
2    NaN    NaN  578  Mike
3   58.0  373.0   12  John

In [2]:
#====Drop and Fill NA
df.dropna(thresh=2) #Drops row wth atleast 2 non-null values
    #Note: dfrm.dropna(axis=1) #Drops col with null values

       A      B    C  Name
0  100.0   15.0   12  John
1   23.0    NaN  264   Lee
2    NaN    NaN  578  Mike
3   58.0  373.0   12  John

In [3]:
df.fillna(value=0) #Fills NA with zeros

df["A"].fillna(value=df["A"].mean()) #Fills NA in col A with mean col A

0    100.000000
1     23.000000
2     60.333333
3     58.000000
Name: A, dtype: float64

In [3]:
#=====Duplicates

df.set_index("Name").index.get_duplicates() #Get duplicates

df["Name"].unique() #array of unique values
df["Name"].nunique() #number of unique values

df["Name"].value_counts() #Counts of duplicates

John    2
Lee     1
Mike    1
Name: Name, dtype: int64

In [12]:
df.drop_duplicates(subset=["Name"]) #Drops duplicate rows

       A     B    C  Name
0  100.0  15.0   12  John
1   23.0   NaN  264   Lee
2    NaN   NaN  578  Mike

In [13]:
df.drop_duplicates(subset=["Name"], keep=False) #Drops duplicates and original rows

      A   B    C  Name
1  23.0 NaN  264   Lee
2   NaN NaN  578  Mike